# Тип заданий №2
## №15124 
Логическая функция F задаётся выражением (x ≡ y ) ∨ ((y ∨ z) → x).
Дан частично заполненный фрагмент, содержащий неповторяющиеся строки таблицы истинности функции F.
Определите, какому столбцу таблицы истинности соответствует каждая из переменных x, y, z.

В ответе напишите буквы x, y, z в том порядке, в котором идут соответствующие им столбцы 
(сначала  — буква, соответствующая первому столбцу; затем  — буква, соответствующая второму столбцу, и т. д.).
Буквы в ответе пишите подряд, никаких разделителей между буквами ставить не нужно.
~~~
for x in range(2):
    for y in range(2):
        for z in range(2):
            if not((x == y) or ((y or z) <= x)):
                print(x, y, z)
~~~
Ответ: xzy
## №18071
Логическая функция F задаётся выражением (x ∧ ¬y) ∨ (y ≡ z) ∨ ¬w.
Дан частично заполненный фрагмент, содержащий неповторяющиеся строки таблицы истинности функции F.
Определите, какому столбцу таблицы истинности соответствует каждая из переменных x, y, z, w.

В ответе напишите буквы x, y, z, w в том порядке, в котором идут соответствующие им столбцы 
(сначала  — буква, соответствующая первому столбцу; затем  — буква, соответствующая второму столбцу, и т. д.). 
Буквы в ответе пишите подряд, никаких разделителей между буквами ставить не нужно.
~~~
for x in range(2):
    for y in range(2):
        for z in range(2):
            for w in range(2):
                if not(x and not(y) or (y == z) or not(w)):
                    print(x, y, z, w)
~~~
Ответ: xwzy

## №15939
Логическая функция F задаётся выражением (z ∧ y) ∨ ((x → z ) ≡ (y → w)).
Дан частично заполненный фрагмент, содержащий неповторяющиеся строки таблицы истинности функции F.
Определите, какому столбцу таблицы истинности соответствует каждая из переменных x, y, z, w.

В ответе напишите буквы x, y, z, w в том порядке, в котором идут соответствующие им столбцы
(сначала  — буква, соответствующая первому столбцу; затем  — буква, соответствующая второму столбцу, и т. д.). 
Буквы в ответе пишите подряд, никаких разделителей между буквами ставить не нужно.
~~~
for x in range(2):
    for y in range(2):
        for z in range(2):
            for w in range(2):
                if not((z and y) or ((x <= z) == (y <= w))):
                    print(x, y, z, w)
~~~
Ответ: wzyx

# Тип заданий №8
## №78064
Все 5⁠-⁠буквенные слова, в составе которых могут быть только буквы К, Р, О, В, А, Т, Ь, записаны в алфавитном порядке и пронумерованы.

Вот начало списка:

1.  ААААА

2.  ААААВ

3.  ААААК

4.  ААААО

5.  ААААР

6.  ААААТ

...

Под каким номером в списке идёт последнее слово c нечётным номером, которое содержит не более одной буквы Т, две буквы В и не содержит букв Ь, стоящих рядом?

~~~
a = 'АВКОРТЬ'
n = 0
s = ''
for i in a:
 for j in a:
  for k in a:
   for l in a:
    for m in a:
     n += 1
     if n % 2 and m != 'Ь' and l != 'Ь' and k != 'Ь' and j != 'Ь' and i != 'Ь':
      if (i+j+k+l+m).count('Т') <= 1 and (i+j+k+l+m).count('В') == 2:
       s = i+j+k+l+m
print(s, n)
~~~
Ответ: 16277
## №3570
Все 4-⁠буквенные слова, составленные из букв С, Л, О, Н записаны в алфавитном порядке и пронумерованы.

Вот начало списка:

1.  ЛЛЛЛ

2.  ЛЛЛН

3.  ЛЛЛО

4.  ЛЛЛС

5.  ЛЛНЛ

...

Запишите слово, которое стоит под номером 250.

~~~
a = 'ЛНОС'
count = 0
for i in a:
    for j in a:
        for k in a:
            for l in a:
                count += 1
                if count == 250:
                    print(f"{i + j + k + l}")
~~~
Ответ: ССОН

## №72566
Требуется разместить два нуля на двух из семи последних мест в восьмизначном числе (ноль не может стоять на первом месте).
Это 21 вариант (число сочетаний из 7 по 2).
Шесть оставшихся мест мы должны заполнять остальными цифрами (кроме нуля). 
Всего имеется 146 - 7529536 вариантов.
Из этого множества нужно исключить числа, в которых все шесть цифр с буквенными обозначениями, а также числа, где одна цифра - десятичная, а остальные пять - буквенные.
Чисел из шести цифр с буквенными обозначениями 56 = 15625.
Чисел, в которых одна цифра десятичная, а пять - буквенные, 6 · 9 · 55 = 168750.

~~~
from math import comb
print(comb(7, 2) * (14**6 - 5**6 - 6*9*5**5))
~~~
Получаем ответ: 21 · (146-56-6 · 9 · 55) = 154248381
